[Killed] StringLiteral
server.js:9:20
 
 const app = express();
 const PORT = 3000;
-const SECRET_KEY = "super_secret_key_that_should_not_be_here";
+const SECRET_KEY = "";
 
 app.use(cors());
killedBy: POST /api/login — EP returns 200 and token when credentials are correct
statusReason: Error: secretOrPrivateKey must have a value

[NoCoverage] BlockStatement
server.js:20:41
 // AUTHENTICATION APIS
 // ==========================================
 
-app.post("/api/register", (req, res) => {
-  const { name, email, password } = req.body;
-  db.run(
-    "INSERT INTO users (name, email, password) VALUES (?, ?, ?)",
-    [name, email, password],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "User registered successfully", id: this.lastID });
-    },
-  );
-});
+app.post("/api/register", (req, res) => {});
 
 app.post("/api/login", (req, res) => {

[NoCoverage] StringLiteral
server.js:23:5
 app.post("/api/register", (req, res) => {
   const { name, email, password } = req.body;
   db.run(
-    "INSERT INTO users (name, email, password) VALUES (?, ?, ?)",
+    "",
     [name, email, password],
     function (err) {

[Killed] StringLiteral
server.js:32:10
   );
 });
 
-app.post("/api/login", (req, res) => {
+app.post("", (req, res) => {
   const { email, password } = req.body;
 
killedBy: POST /api/login — EP returns 200 and token when credentials are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
server.js:35:10
 app.post("/api/login", (req, res) => {
   const { email, password } = req.body;
 
-  db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
+  db.get("", [email], (err, user) => {
     if (err) return res.status(500).json({ error: err.message });
     if (!user)
killedBy: POST /api/login — EP returns 200 and token when credentials are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
server.js:37:9
 
   db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
     if (err) return res.status(500).json({ error: err.message });
-    if (!user)
+    if (true)
       return res.status(401).json({ error: "Invalid email or password" });
 
killedBy: POST /api/login — EP returns 200 and token when credentials are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
server.js:37:9
 
   db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
     if (err) return res.status(500).json({ error: err.message });
-    if (!user)
+    if (false)
       return res.status(401).json({ error: "Invalid email or password" });
 
killedBy: POST /api/login — EP returns 401 when email is not registered
statusReason: TypeError: Cannot read properties of undefined (reading 'locked_until')

[Survived] ObjectLiteral
server.js:38:35
   db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
     if (err) return res.status(500).json({ error: err.message });
     if (!user)
-      return res.status(401).json({ error: "Invalid email or password" });
+      return res.status(401).json({});
 
     if (user.locked_until && new Date() < new Date(user.locked_until)) {

[Killed] ConditionalExpression
server.js:40:9
     if (!user)
       return res.status(401).json({ error: "Invalid email or password" });
 
-    if (user.locked_until && new Date() < new Date(user.locked_until)) {
+    if (false) {
       return res
         .status(403)
killedBy: POST /api/login — EP when account is locked returns 403 when account is locked even with correct credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 200

[Killed] ObjectLiteral
server.js:43:15
     if (user.locked_until && new Date() < new Date(user.locked_until)) {
       return res
         .status(403)
-        .json({ error: "Tài khoản đã bị khóa. Vui lòng thử lại sau." });
+        .json({});
     }
 
killedBy: POST /api/login — EP when account is locked returns 403 when account is locked even with correct credentials
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
server.js:46:9
         .json({ error: "Tài khoản đã bị khóa. Vui lòng thử lại sau." });
     }
 
-    if (user.password === password) {
+    if (true) {
       db.run(
         "UPDATE users SET login_attempts = 0, locked_until = NULL WHERE id = ?",
killedBy: POST /api/login — EP returns 401 when password is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ObjectLiteral
server.js:63:28
         "UPDATE users SET login_attempts = ?, locked_until = ? WHERE id = ?",
         [newAttempts, lockedUntil, user.id],
       );
-      res.status(401).json({ error: "Invalid email or password" });
+      res.status(401).json({});
     }
   });
killedBy: POST /api/login — EP returns 401 when password is wrong
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[NoCoverage] BlockStatement
server.js:68:48
   });
 });
 
-app.post("/api/forgot-password", (req, res) => {
-  const { email } = req.body;
-  db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
-    if (!user) return res.status(404).json({ error: "User not found" });
-    const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
-    db.run(
-      "UPDATE users SET reset_token = ? WHERE id = ?",
-      [resetToken, user.id],
-      (err) => {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({
-          message: "Mã đặt lại mật khẩu đã được tạo",
-          resetToken: resetToken,
-        });
-      },
-    );
-  });
-});
+app.post("/api/forgot-password", (req, res) => {});
 
 app.post("/api/reset-password", (req, res) => {

[NoCoverage] BooleanLiteral
server.js:71:9
 app.post("/api/forgot-password", (req, res) => {
   const { email } = req.body;
   db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
-    if (!user) return res.status(404).json({ error: "User not found" });
+    if (user) return res.status(404).json({ error: "User not found" });
     const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
     db.run(

[NoCoverage] StringLiteral
server.js:79:20
       (err) => {
         if (err) return res.status(500).json({ error: err.message });
         res.json({
-          message: "Mã đặt lại mật khẩu đã được tạo",
+          message: "",
           resetToken: resetToken,
         });

[NoCoverage] BlockStatement
server.js:87:47
   });
 });
 
-app.post("/api/reset-password", (req, res) => {
-  const { email, resetToken, newPassword } = req.body;
-  db.run(
-    "UPDATE users SET password = ?, reset_token = NULL WHERE email = ? AND reset_token = ?",
-    [newPassword, email, resetToken],
-    function (err) {
-      if (this.changes === 0)
-        return res.status(400).json({ error: "Invalid token or email" });
-      res.json({ message: "Password reset successfully" });
-    },
-  );
-});
+app.post("/api/reset-password", (req, res) => {});
 
 const authenticateToken = (req, res, next) => {

[NoCoverage] StringLiteral
server.js:90:5
 app.post("/api/reset-password", (req, res) => {
   const { email, resetToken, newPassword } = req.body;
   db.run(
-    "UPDATE users SET password = ?, reset_token = NULL WHERE email = ? AND reset_token = ?",
+    "",
     [newPassword, email, resetToken],
     function (err) {

[NoCoverage] BlockStatement
server.js:92:20
   db.run(
     "UPDATE users SET password = ?, reset_token = NULL WHERE email = ? AND reset_token = ?",
     [newPassword, email, resetToken],
-    function (err) {
-      if (this.changes === 0)
-        return res.status(400).json({ error: "Invalid token or email" });
-      res.json({ message: "Password reset successfully" });
-    },
+    function (err) {},
   );
 });

[NoCoverage] ConditionalExpression
server.js:93:11
     "UPDATE users SET password = ?, reset_token = NULL WHERE email = ? AND reset_token = ?",
     [newPassword, email, resetToken],
     function (err) {
-      if (this.changes === 0)
+      if (true)
         return res.status(400).json({ error: "Invalid token or email" });
       res.json({ message: "Password reset successfully" });

[NoCoverage] ConditionalExpression
server.js:93:11
     "UPDATE users SET password = ?, reset_token = NULL WHERE email = ? AND reset_token = ?",
     [newPassword, email, resetToken],
     function (err) {
-      if (this.changes === 0)
+      if (false)
         return res.status(400).json({ error: "Invalid token or email" });
       res.json({ message: "Password reset successfully" });

[Killed] BlockStatement
server.js:100:47
   );
 });
 
-const authenticateToken = (req, res, next) => {
-  const authHeader = req.headers["authorization"];
-  const token = authHeader && authHeader.split(" ")[1];
-  if (token == null) return res.status(401).json({ error: "Unauthorized" });
-
-  jwt.verify(token, SECRET_KEY, (err, user) => {
-    if (err) return res.status(403).json({ error: "Forbidden" });
-    req.user = user;
-    next();
-  });
-};
+const authenticateToken = (req, res, next) => {};
 
 app.get("/api/users/me", authenticateToken, (req, res) => {
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is pending to confirmed
statusReason: Error: Response timeout of 2000ms exceeded

[NoCoverage] BlockStatement
server.js:112:59
   });
 };
 
-app.get("/api/users/me", authenticateToken, (req, res) => {
-  db.get("SELECT * FROM users WHERE id = ?", [req.user.id], (err, user) => {
-    res.json(user);
-  });
-});
+app.get("/api/users/me", authenticateToken, (req, res) => {});
 
 app.put("/api/users/me", authenticateToken, (req, res) => {

[NoCoverage] BlockStatement
server.js:113:76
 };
 
 app.get("/api/users/me", authenticateToken, (req, res) => {
-  db.get("SELECT * FROM users WHERE id = ?", [req.user.id], (err, user) => {
-    res.json(user);
-  });
+  db.get("SELECT * FROM users WHERE id = ?", [req.user.id], (err, user) => {});
 });
 

[NoCoverage] StringLiteral
server.js:113:10
 };
 
 app.get("/api/users/me", authenticateToken, (req, res) => {
-  db.get("SELECT * FROM users WHERE id = ?", [req.user.id], (err, user) => {
+  db.get("", [req.user.id], (err, user) => {
     res.json(user);
   });

[NoCoverage] BlockStatement
server.js:118:59
   });
 });
 
-app.put("/api/users/me", authenticateToken, (req, res) => {
-  const { name, shipping_address, phone, role } = req.body;
-
-  let query = "UPDATE users SET name = ?, shipping_address = ?, phone = ?";
-  let params = [name, shipping_address, phone];
-
-  if (role) {
-    query += ", role = ?";
-    params.push(role);
-  }
-  query += " WHERE id = ?";
-  params.push(req.user.id);
-
-  db.run(query, params, function (err) {
-    if (err) return res.status(500).json({ error: err.message });
-    res.json({ message: "Profile updated" });
-  });
-});
+app.put("/api/users/me", authenticateToken, (req, res) => {});
 
 // ==========================================

[NoCoverage] ArrayDeclaration
server.js:122:16
   const { name, shipping_address, phone, role } = req.body;
 
   let query = "UPDATE users SET name = ?, shipping_address = ?, phone = ?";
-  let params = [name, shipping_address, phone];
+  let params = [];
 
   if (role) {

[NoCoverage] ConditionalExpression
server.js:124:7
   let query = "UPDATE users SET name = ?, shipping_address = ?, phone = ?";
   let params = [name, shipping_address, phone];
 
-  if (role) {
+  if (true) {
     query += ", role = ?";
     params.push(role);

[NoCoverage] StringLiteral
server.js:125:14
   let params = [name, shipping_address, phone];
 
   if (role) {
-    query += ", role = ?";
+    query += "";
     params.push(role);
   }

[NoCoverage] BlockStatement
server.js:141:40
 // PRODUCT APIS
 // ==========================================
 
-app.get("/api/products", (req, res) => {
-  const searchQuery = req.query.search;
-  if (searchQuery) {
-    const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
-    db.all(query, [], (err, rows) => {
-      if (err)
-        return res
-          .status(500)
-          .send(`<h1>Database Error</h1><p>${err.message}</p>`);
-      res.json(rows);
-    });
-  } else {
-    db.all("SELECT * FROM products", [], (err, rows) => {
-      res.json(rows);
-    });
-  }
-});
+app.get("/api/products", (req, res) => {});
 
 app.get("/api/products/:id", (req, res) => {

[NoCoverage] BlockStatement
server.js:143:20
 
 app.get("/api/products", (req, res) => {
   const searchQuery = req.query.search;
-  if (searchQuery) {
-    const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
-    db.all(query, [], (err, rows) => {
-      if (err)
-        return res
-          .status(500)
-          .send(`<h1>Database Error</h1><p>${err.message}</p>`);
-      res.json(rows);
-    });
-  } else {
+  if (searchQuery) {} else {
     db.all("SELECT * FROM products", [], (err, rows) => {
       res.json(rows);

[NoCoverage] ConditionalExpression
server.js:143:7
 
 app.get("/api/products", (req, res) => {
   const searchQuery = req.query.search;
-  if (searchQuery) {
+  if (false) {
     const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
     db.all(query, [], (err, rows) => {

[NoCoverage] BlockStatement
server.js:145:38
   const searchQuery = req.query.search;
   if (searchQuery) {
     const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
-    db.all(query, [], (err, rows) => {
-      if (err)
-        return res
-          .status(500)
-          .send(`<h1>Database Error</h1><p>${err.message}</p>`);
-      res.json(rows);
-    });
+    db.all(query, [], (err, rows) => {});
   } else {
     db.all("SELECT * FROM products", [], (err, rows) => {

[NoCoverage] ConditionalExpression
server.js:146:11
   if (searchQuery) {
     const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
     db.all(query, [], (err, rows) => {
-      if (err)
+      if (true)
         return res
           .status(500)

[NoCoverage] ConditionalExpression
server.js:146:11
   if (searchQuery) {
     const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
     db.all(query, [], (err, rows) => {
-      if (err)
+      if (false)
         return res
           .status(500)

[NoCoverage] StringLiteral
server.js:149:17
       if (err)
         return res
           .status(500)
-          .send(`<h1>Database Error</h1><p>${err.message}</p>`);
+          .send(``);
       res.json(rows);
     });

[NoCoverage] BlockStatement
server.js:159:44
   }
 });
 
-app.get("/api/products/:id", (req, res) => {
-  db.get("SELECT * FROM products WHERE id = ?", [req.params.id], (err, row) => {
-    if (!row) return res.status(200).json({});
-    if (row.id % 2 === 0) row.price = row.price.toString();
-    res.json(row);
-  });
-});
+app.get("/api/products/:id", (req, res) => {});
 
 app.post("/api/products", (req, res) => {

[NoCoverage] BlockStatement
server.js:160:80
 });
 
 app.get("/api/products/:id", (req, res) => {
-  db.get("SELECT * FROM products WHERE id = ?", [req.params.id], (err, row) => {
-    if (!row) return res.status(200).json({});
-    if (row.id % 2 === 0) row.price = row.price.toString();
-    res.json(row);
-  });
+  db.get("SELECT * FROM products WHERE id = ?", [req.params.id], (err, row) => {});
 });
 

[NoCoverage] StringLiteral
server.js:160:10
 });
 
 app.get("/api/products/:id", (req, res) => {
-  db.get("SELECT * FROM products WHERE id = ?", [req.params.id], (err, row) => {
+  db.get("", [req.params.id], (err, row) => {
     if (!row) return res.status(200).json({});
     if (row.id % 2 === 0) row.price = row.price.toString();

[NoCoverage] BooleanLiteral
server.js:161:9
 
 app.get("/api/products/:id", (req, res) => {
   db.get("SELECT * FROM products WHERE id = ?", [req.params.id], (err, row) => {
-    if (!row) return res.status(200).json({});
+    if (row) return res.status(200).json({});
     if (row.id % 2 === 0) row.price = row.price.toString();
     res.json(row);

[NoCoverage] ConditionalExpression
server.js:161:9
 
 app.get("/api/products/:id", (req, res) => {
   db.get("SELECT * FROM products WHERE id = ?", [req.params.id], (err, row) => {
-    if (!row) return res.status(200).json({});
+    if (true) return res.status(200).json({});
     if (row.id % 2 === 0) row.price = row.price.toString();
     res.json(row);

[NoCoverage] EqualityOperator
server.js:162:9
 app.get("/api/products/:id", (req, res) => {
   db.get("SELECT * FROM products WHERE id = ?", [req.params.id], (err, row) => {
     if (!row) return res.status(200).json({});
-    if (row.id % 2 === 0) row.price = row.price.toString();
+    if (row.id % 2 !== 0) row.price = row.price.toString();
     res.json(row);
   });

[NoCoverage] ConditionalExpression
server.js:162:9
 app.get("/api/products/:id", (req, res) => {
   db.get("SELECT * FROM products WHERE id = ?", [req.params.id], (err, row) => {
     if (!row) return res.status(200).json({});
-    if (row.id % 2 === 0) row.price = row.price.toString();
+    if (true) row.price = row.price.toString();
     res.json(row);
   });

[NoCoverage] BlockStatement
server.js:167:41
   });
 });
 
-app.post("/api/products", (req, res) => {
-  const { name, price, description, imageUrl, category_id } = req.body;
-  db.run(
-    "INSERT INTO products (name, price, description, imageUrl, category_id) VALUES (?, ?, ?, ?, ?)",
-    [name, price, description, imageUrl, category_id],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Product created", id: this.lastID });
-    },
-  );
-});
+app.post("/api/products", (req, res) => {});
 
 app.put("/api/products/:id", (req, res) => {

[NoCoverage] BlockStatement
server.js:179:44
   );
 });
 
-app.put("/api/products/:id", (req, res) => {
-  const { name, price, description, imageUrl, category_id } = req.body;
-  db.run(
-    "UPDATE products SET name = ?, price = ?, description = ?, imageUrl = ?, category_id = ? WHERE id = ?",
-    [name, price, description, imageUrl, category_id, req.params.id],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Product updated" });
-    },
-  );
-});
+app.put("/api/products/:id", (req, res) => {});
 
 app.delete("/api/products/:id", (req, res) => {

[Survived] StringLiteral
server.js:179:9
   );
 });
 
-app.put("/api/products/:id", (req, res) => {
+app.put("", (req, res) => {
   const { name, price, description, imageUrl, category_id } = req.body;
   db.run(

[NoCoverage] BlockStatement
server.js:191:47
   );
 });
 
-app.delete("/api/products/:id", (req, res) => {
-  db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
-    res.json({ message: "Product deleted" });
-  });
-});
+app.delete("/api/products/:id", (req, res) => {});
 
 // Import products from CSV (parsed on frontend, sent as JSON array)

[NoCoverage] BlockStatement
server.js:192:79
 });
 
 app.delete("/api/products/:id", (req, res) => {
-  db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
-    res.json({ message: "Product deleted" });
-  });
+  db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {});
 });
 

[NoCoverage] StringLiteral
server.js:192:10
 });
 
 app.delete("/api/products/:id", (req, res) => {
-  db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
+  db.run("", [req.params.id], function (err) {
     if (err) return res.status(500).json({ error: err.message });
     res.json({ message: "Product deleted" });

[NoCoverage] ConditionalExpression
server.js:202:7
 app.post("/api/admin/import-products", authenticateToken, (req, res) => {
   const { products: rows } = req.body;
 
-  if (!rows || !Array.isArray(rows) || rows.length === 0) {
+  if (false) {
     return res.status(400).json({ error: "Không có dữ liệu để import" });
   }

[NoCoverage] ConditionalExpression
server.js:202:7
 app.post("/api/admin/import-products", authenticateToken, (req, res) => {
   const { products: rows } = req.body;
 
-  if (!rows || !Array.isArray(rows) || rows.length === 0) {
+  if (false || rows.length === 0) {
     return res.status(400).json({ error: "Không có dữ liệu để import" });
   }

[NoCoverage] BlockStatement
server.js:214:20
   );
 
   rows.forEach((row, index) => {
-    if (!row.name) {
-      errors.push(`Hàng ${index + 2}: Thiếu tên sản phẩm`);
-      return;
-    }
+    if (!row.name) {}
     stmt.run(
       row.name,

[NoCoverage] LogicalOperator
server.js:221:7
     stmt.run(
       row.name,
       row.price,
-      row.description || "",
+      row.description && "",
       row.imageUrl || "",
       row.category_id || 1,

[NoCoverage] LogicalOperator
server.js:222:7
       row.name,
       row.price,
       row.description || "",
-      row.imageUrl || "",
+      row.imageUrl && "",
       row.category_id || 1,
       function (err) {

[NoCoverage] StringLiteral
server.js:226:23
       row.category_id || 1,
       function (err) {
         if (err) {
-          errors.push(`Hàng ${index + 2}: ${err.message}`);
+          errors.push(``);
         } else {
           inserted++;

[NoCoverage] StringLiteral
server.js:236:16
 
   stmt.finalize(() => {
     res.json({
-      message: `Import hoàn tất: ${inserted}/${rows.length} sản phẩm được thêm`,
+      message: ``,
       inserted,
       errors,

[NoCoverage] BlockStatement
server.js:243:42
   });
 });
 
-app.get("/api/categories", (req, res) => {
-  db.all("SELECT * FROM categories", [], (err, rows) => {
-    res.json(rows);
-  });
-});
+app.get("/api/categories", (req, res) => {});
 
 app.post("/api/categories", authenticateToken, (req, res) => {

[NoCoverage] BlockStatement
server.js:244:57
 });
 
 app.get("/api/categories", (req, res) => {
-  db.all("SELECT * FROM categories", [], (err, rows) => {
-    res.json(rows);
-  });
+  db.all("SELECT * FROM categories", [], (err, rows) => {});
 });
 

[NoCoverage] BlockStatement
server.js:249:62
   });
 });
 
-app.post("/api/categories", authenticateToken, (req, res) => {
-  const { name } = req.body;
-  db.run("INSERT INTO categories (name) VALUES (?)", [name], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
-    res.json({ message: "Category created", id: this.lastID });
-  });
-});
+app.post("/api/categories", authenticateToken, (req, res) => {});
 
 app.put("/api/categories/:id", authenticateToken, (req, res) => {

[NoCoverage] BlockStatement
server.js:251:77
 
 app.post("/api/categories", authenticateToken, (req, res) => {
   const { name } = req.body;
-  db.run("INSERT INTO categories (name) VALUES (?)", [name], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
-    res.json({ message: "Category created", id: this.lastID });
-  });
+  db.run("INSERT INTO categories (name) VALUES (?)", [name], function (err) {});
 });
 

[NoCoverage] StringLiteral
server.js:251:10
 
 app.post("/api/categories", authenticateToken, (req, res) => {
   const { name } = req.body;
-  db.run("INSERT INTO categories (name) VALUES (?)", [name], function (err) {
+  db.run("", [name], function (err) {
     if (err) return res.status(500).json({ error: err.message });
     res.json({ message: "Category created", id: this.lastID });

[NoCoverage] ConditionalExpression
server.js:252:9
 app.post("/api/categories", authenticateToken, (req, res) => {
   const { name } = req.body;
   db.run("INSERT INTO categories (name) VALUES (?)", [name], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
+    if (true) return res.status(500).json({ error: err.message });
     res.json({ message: "Category created", id: this.lastID });
   });

[NoCoverage] ConditionalExpression
server.js:252:9
 app.post("/api/categories", authenticateToken, (req, res) => {
   const { name } = req.body;
   db.run("INSERT INTO categories (name) VALUES (?)", [name], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
+    if (false) return res.status(500).json({ error: err.message });
     res.json({ message: "Category created", id: this.lastID });
   });

[NoCoverage] BlockStatement
server.js:257:65
   });
 });
 
-app.put("/api/categories/:id", authenticateToken, (req, res) => {
-  const { name } = req.body;
-  db.run(
-    "UPDATE categories SET name = ? WHERE id = ?",
-    [name, req.params.id],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Category updated" });
-    },
-  );
-});
+app.put("/api/categories/:id", authenticateToken, (req, res) => {});
 
 app.delete("/api/categories/:id", authenticateToken, (req, res) => {

[NoCoverage] StringLiteral
server.js:260:5
 app.put("/api/categories/:id", authenticateToken, (req, res) => {
   const { name } = req.body;
   db.run(
-    "UPDATE categories SET name = ? WHERE id = ?",
+    "",
     [name, req.params.id],
     function (err) {

[NoCoverage] ArrayDeclaration
server.js:261:5
   const { name } = req.body;
   db.run(
     "UPDATE categories SET name = ? WHERE id = ?",
-    [name, req.params.id],
+    [],
     function (err) {
       if (err) return res.status(500).json({ error: err.message });

[NoCoverage] BlockStatement
server.js:262:20
   db.run(
     "UPDATE categories SET name = ? WHERE id = ?",
     [name, req.params.id],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Category updated" });
-    },
+    function (err) {},
   );
 });

[NoCoverage] ObjectLiteral
server.js:264:16
     [name, req.params.id],
     function (err) {
       if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Category updated" });
+      res.json({});
     },
   );

[NoCoverage] BlockStatement
server.js:269:68
   );
 });
 
-app.delete("/api/categories/:id", authenticateToken, (req, res) => {
-  db.run(
-    "DELETE FROM categories WHERE id = ?",
-    [req.params.id],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Category deleted" });
-    },
-  );
-});
+app.delete("/api/categories/:id", authenticateToken, (req, res) => {});
 
 // ==========================================

[Survived] StringLiteral
server.js:269:12
   );
 });
 
-app.delete("/api/categories/:id", authenticateToken, (req, res) => {
+app.delete("", authenticateToken, (req, res) => {
   db.run(
     "DELETE FROM categories WHERE id = ?",

[NoCoverage] ArrayDeclaration
server.js:272:5
 app.delete("/api/categories/:id", authenticateToken, (req, res) => {
   db.run(
     "DELETE FROM categories WHERE id = ?",
-    [req.params.id],
+    [],
     function (err) {
       if (err) return res.status(500).json({ error: err.message });

[NoCoverage] BlockStatement
server.js:273:20
   db.run(
     "DELETE FROM categories WHERE id = ?",
     [req.params.id],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Category deleted" });
-    },
+    function (err) {},
   );
 });

[NoCoverage] ObjectLiteral
server.js:275:16
     [req.params.id],
     function (err) {
       if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Category deleted" });
+      res.json({});
     },
   );

[Killed] BlockStatement
server.js:284:55
 // CART & CHECKOUT APIS
 // ==========================================
 
-app.get("/api/cart", authenticateToken, (req, res) => {
-  const userId = req.user.id;
-  if (!userCarts[userId]) userCarts[userId] = [];
-  res.json(userCarts[userId]);
-});
+app.get("/api/cart", authenticateToken, (req, res) => {});
 
 app.post("/api/cart", authenticateToken, (req, res) => {
killedBy: Cart and checkout routes - T3b baseline returns 200 and an array when authenticated user requests cart
statusReason: Error: Response timeout of 2000ms exceeded

[Killed] BlockStatement
server.js:290:56
   res.json(userCarts[userId]);
 });
 
-app.post("/api/cart", authenticateToken, (req, res) => {
-  const userId = req.user.id;
-  if (!userCarts[userId]) userCarts[userId] = [];
-  userCarts[userId].push(req.body);
-  res.json({ message: "Added to cart" });
-});
+app.post("/api/cart", authenticateToken, (req, res) => {});
 
 app.post("/api/checkout", authenticateToken, (req, res) => {
killedBy: Cart and checkout routes - T3b baseline returns 200 and stores item when authenticated user adds item to cart
statusReason: Error: Response timeout of 2000ms exceeded

[Killed] StringLiteral
server.js:294:23
   const userId = req.user.id;
   if (!userCarts[userId]) userCarts[userId] = [];
   userCarts[userId].push(req.body);
-  res.json({ message: "Added to cart" });
+  res.json({ message: "" });
 });
 
killedBy: Cart and checkout routes - T3b baseline returns 200 and stores item when authenticated user adds item to cart
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /added/i
Received string:  ""
