[Killed] BlockStatement
server.js:297:60
   res.json({ message: "Added to cart" });
 });
 
-app.post("/api/checkout", authenticateToken, (req, res) => {
-  const userId = req.user.id;
-  const { total_amount, shipping_address } = req.body;
-
-  db.run(
-    "INSERT INTO orders (user_id, total_amount, status, shipping_address) VALUES (?, ?, ?, ?)",
-    [userId, total_amount, "pending", shipping_address],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Checkout successful", orderId: this.lastID });
-    },
-  );
-});
+app.post("/api/checkout", authenticateToken, (req, res) => {});
 
 app.get("/api/orders/my-orders", authenticateToken, (req, res) => {
killedBy: Cart and checkout routes - T3b baseline returns 200 and creates pending order when checkout is authenticated
statusReason: Error: Response timeout of 2000ms exceeded

[NoCoverage] BlockStatement
server.js:311:67
   );
 });
 
-app.get("/api/orders/my-orders", authenticateToken, (req, res) => {
-  db.all(
-    "SELECT * FROM orders WHERE user_id = ? ORDER BY id DESC",
-    [req.user.id],
-    (err, orders) => {
-      res.json(orders);
-    },
-  );
-});
+app.get("/api/orders/my-orders", authenticateToken, (req, res) => {});
 
 app.put("/api/orders/:id/cancel", authenticateToken, (req, res) => {

[Survived] StringLiteral
server.js:311:9
   );
 });
 
-app.get("/api/orders/my-orders", authenticateToken, (req, res) => {
+app.get("", authenticateToken, (req, res) => {
   db.all(
     "SELECT * FROM orders WHERE user_id = ? ORDER BY id DESC",

[NoCoverage] BlockStatement
server.js:315:22
   db.all(
     "SELECT * FROM orders WHERE user_id = ? ORDER BY id DESC",
     [req.user.id],
-    (err, orders) => {
-      res.json(orders);
-    },
+    (err, orders) => {},
   );
 });

[NoCoverage] BlockStatement
server.js:321:68
   );
 });
 
-app.put("/api/orders/:id/cancel", authenticateToken, (req, res) => {
-  db.get(
-    "SELECT * FROM orders WHERE id = ? AND user_id = ?",
-    [req.params.id, req.user.id],
-    (err, order) => {
-      if (!order) return res.status(404).json({ error: "Order not found" });
-
-      // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
-      if (order.status === "delivered" || order.status === "canceled") {
-        return res.status(400).json({ error: "Cannot cancel this order." });
-      }
-
-      db.run(
-        "UPDATE orders SET status = ? WHERE id = ?",
-        ["canceled", req.params.id],
-        function (err) {
-          res.json({ message: "Order canceled successfully" });
-        },
-      );
-    },
-  );
-});
+app.put("/api/orders/:id/cancel", authenticateToken, (req, res) => {});
 
 app.get("/api/orders/:id", (req, res) => {

[Survived] StringLiteral
server.js:321:9
   );
 });
 
-app.put("/api/orders/:id/cancel", authenticateToken, (req, res) => {
+app.put("", authenticateToken, (req, res) => {
   db.get(
     "SELECT * FROM orders WHERE id = ? AND user_id = ?",

[NoCoverage] BlockStatement
server.js:325:21
   db.get(
     "SELECT * FROM orders WHERE id = ? AND user_id = ?",
     [req.params.id, req.user.id],
-    (err, order) => {
-      if (!order) return res.status(404).json({ error: "Order not found" });
-
-      // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
-      if (order.status === "delivered" || order.status === "canceled") {
-        return res.status(400).json({ error: "Cannot cancel this order." });
-      }
-
-      db.run(
-        "UPDATE orders SET status = ? WHERE id = ?",
-        ["canceled", req.params.id],
-        function (err) {
-          res.json({ message: "Order canceled successfully" });
-        },
-      );
-    },
+    (err, order) => {},
   );
 });

[NoCoverage] BooleanLiteral
server.js:326:11
     "SELECT * FROM orders WHERE id = ? AND user_id = ?",
     [req.params.id, req.user.id],
     (err, order) => {
-      if (!order) return res.status(404).json({ error: "Order not found" });
+      if (order) return res.status(404).json({ error: "Order not found" });
 
       // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')

[NoCoverage] BlockStatement
server.js:329:72
       if (!order) return res.status(404).json({ error: "Order not found" });
 
       // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
-      if (order.status === "delivered" || order.status === "canceled") {
-        return res.status(400).json({ error: "Cannot cancel this order." });
-      }
+      if (order.status === "delivered" || order.status === "canceled") {}
 
       db.run(

[NoCoverage] ObjectLiteral
server.js:330:37
 
       // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
       if (order.status === "delivered" || order.status === "canceled") {
-        return res.status(400).json({ error: "Cannot cancel this order." });
+        return res.status(400).json({});
       }
 

[NoCoverage] StringLiteral
server.js:334:9
       }
 
       db.run(
-        "UPDATE orders SET status = ? WHERE id = ?",
+        "",
         ["canceled", req.params.id],
         function (err) {

[NoCoverage] BlockStatement
server.js:336:24
       db.run(
         "UPDATE orders SET status = ? WHERE id = ?",
         ["canceled", req.params.id],
-        function (err) {
-          res.json({ message: "Order canceled successfully" });
-        },
+        function (err) {},
       );
     },

[NoCoverage] StringLiteral
server.js:337:31
         "UPDATE orders SET status = ? WHERE id = ?",
         ["canceled", req.params.id],
         function (err) {
-          res.json({ message: "Order canceled successfully" });
+          res.json({ message: "" });
         },
       );

[NoCoverage] BlockStatement
server.js:344:42
   );
 });
 
-app.get("/api/orders/:id", (req, res) => {
-  db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
-    if (!order) return res.status(404).json({ error: "Order not found" });
-    res.json(order);
-  });
-});
+app.get("/api/orders/:id", (req, res) => {});
 
 // ==========================================

[Survived] StringLiteral
server.js:344:9
   );
 });
 
-app.get("/api/orders/:id", (req, res) => {
+app.get("", (req, res) => {
   db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
     if (!order) return res.status(404).json({ error: "Order not found" });

[NoCoverage] BlockStatement
server.js:345:80
 });
 
 app.get("/api/orders/:id", (req, res) => {
-  db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
-    if (!order) return res.status(404).json({ error: "Order not found" });
-    res.json(order);
-  });
+  db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {});
 });
 

[NoCoverage] ArrayDeclaration
server.js:345:47
 });
 
 app.get("/api/orders/:id", (req, res) => {
-  db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
+  db.get("SELECT * FROM orders WHERE id = ?", [], (err, order) => {
     if (!order) return res.status(404).json({ error: "Order not found" });
     res.json(order);

[NoCoverage] ConditionalExpression
server.js:346:9
 
 app.get("/api/orders/:id", (req, res) => {
   db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
-    if (!order) return res.status(404).json({ error: "Order not found" });
+    if (false) return res.status(404).json({ error: "Order not found" });
     res.json(order);
   });

[NoCoverage] BooleanLiteral
server.js:346:9
 
 app.get("/api/orders/:id", (req, res) => {
   db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
-    if (!order) return res.status(404).json({ error: "Order not found" });
+    if (order) return res.status(404).json({ error: "Order not found" });
     res.json(order);
   });

[NoCoverage] BlockStatement
server.js:356:58
 // ==========================================
 
 // GET all coupons (public - for admin display)
-app.get("/api/coupons", authenticateToken, (req, res) => {
-  db.all("SELECT * FROM coupons", [], (err, rows) => {
-    res.json(rows);
-  });
-});
+app.get("/api/coupons", authenticateToken, (req, res) => {});
 
 // POST apply-coupon

[NoCoverage] BlockStatement
server.js:357:54
 
 // GET all coupons (public - for admin display)
 app.get("/api/coupons", authenticateToken, (req, res) => {
-  db.all("SELECT * FROM coupons", [], (err, rows) => {
-    res.json(rows);
-  });
+  db.all("SELECT * FROM coupons", [], (err, rows) => {});
 });
 

[NoCoverage] StringLiteral
server.js:357:10
 
 // GET all coupons (public - for admin display)
 app.get("/api/coupons", authenticateToken, (req, res) => {
-  db.all("SELECT * FROM coupons", [], (err, rows) => {
+  db.all("", [], (err, rows) => {
     res.json(rows);
   });

[Killed] BooleanLiteral
server.js:366:7
 app.post("/api/apply-coupon", (req, res) => {
   const { code, total_amount, user_id } = req.body;
 
-  if (!code)
+  if (code)
     return res.status(400).json({ error: "Vui lòng nhập mã giảm giá" });
 
killedBy: POST /api/apply-coupon — EP returns 200 with correct discount when valid fixed coupon meets min-order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] StringLiteral
server.js:370:5
     return res.status(400).json({ error: "Vui lòng nhập mã giảm giá" });
 
   db.get(
-    "SELECT * FROM coupons WHERE code = ? AND is_active = 1",
+    "",
     [code],
     (err, coupon) => {
killedBy: POST /api/apply-coupon — EP returns 200 with correct discount when valid fixed coupon meets min-order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ArrayDeclaration
server.js:371:5
 
   db.get(
     "SELECT * FROM coupons WHERE code = ? AND is_active = 1",
-    [code],
+    [],
     (err, coupon) => {
       if (!coupon) {
killedBy: POST /api/apply-coupon — EP returns 200 with correct discount when valid fixed coupon meets min-order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
server.js:373:11
     "SELECT * FROM coupons WHERE code = ? AND is_active = 1",
     [code],
     (err, coupon) => {
-      if (!coupon) {
+      if (true) {
         return res
           .status(404)
killedBy: POST /api/apply-coupon — EP returns 200 with correct discount when valid fixed coupon meets min-order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
server.js:373:20
     "SELECT * FROM coupons WHERE code = ? AND is_active = 1",
     [code],
     (err, coupon) => {
-      if (!coupon) {
-        return res
-          .status(404)
-          .json({ error: "Mã giảm giá không tồn tại hoặc đã bị vô hiệu hóa" });
-      }
+      if (!coupon) {}
 
       if (total_amount > coupon.min_order_amount) {
killedBy: POST /api/apply-coupon — EP returns 404 when coupon code does not exist
statusReason: TypeError: Cannot read properties of undefined (reading 'min_order_amount')

[Killed] ConditionalExpression
server.js:379:11
           .json({ error: "Mã giảm giá không tồn tại hoặc đã bị vô hiệu hóa" });
       }
 
-      if (total_amount > coupon.min_order_amount) {
+      if (true) {
         const now = new Date();
         const expiry = new Date(coupon.expired_at);
killedBy: POST /api/apply-coupon — EP returns 400 when total_amount is below min-order threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
server.js:390:30
           db.get(
             "SELECT COUNT(*) as usage_count FROM coupon_usage WHERE coupon_id = ? AND user_id = ?",
             [coupon.id, user_id],
-            (err, result) => {
-              if (result.usage_count >= coupon.max_uses_per_user) {
-                return res.status(400).json({
-                  error: `Bạn đã sử dụng mã này ${coupon.max_uses_per_user} lần (đã đạt giới hạn)`,
-                });
-              }
-
-              let discount_amount = 0;
-              if (coupon.type === "percent") {
-                discount_amount = Math.floor(
-                  total_amount * (1 - coupon.discount_value),
-                );
-              } else {
-                discount_amount = coupon.discount_value;
-              }
-
-              const final_amount = total_amount - discount_amount;
-              return res.json({
-                success: true,
-                coupon_id: coupon.id,
-                discount_amount,
-                final_amount,
-                message: `Áp dụng thành công! Giảm ${coupon.type === "percent" ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
-              });
-            },
+            (err, result) => {},
           );
         } else {
killedBy: POST /api/apply-coupon — EP returns 400 when user has reached the usage limit
statusReason: Error: Response timeout of 2000ms exceeded

[Killed] EqualityOperator
server.js:391:19
             "SELECT COUNT(*) as usage_count FROM coupon_usage WHERE coupon_id = ? AND user_id = ?",
             [coupon.id, user_id],
             (err, result) => {
-              if (result.usage_count >= coupon.max_uses_per_user) {
+              if (result.usage_count > coupon.max_uses_per_user) {
                 return res.status(400).json({
                   error: `Bạn đã sử dụng mã này ${coupon.max_uses_per_user} lần (đã đạt giới hạn)`,
killedBy: POST /api/apply-coupon — EP returns 400 when user has reached the usage limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
server.js:391:67
             "SELECT COUNT(*) as usage_count FROM coupon_usage WHERE coupon_id = ? AND user_id = ?",
             [coupon.id, user_id],
             (err, result) => {
-              if (result.usage_count >= coupon.max_uses_per_user) {
-                return res.status(400).json({
-                  error: `Bạn đã sử dụng mã này ${coupon.max_uses_per_user} lần (đã đạt giới hạn)`,
-                });
-              }
+              if (result.usage_count >= coupon.max_uses_per_user) {}
 
               let discount_amount = 0;
killedBy: POST /api/apply-coupon — EP returns 400 when user has reached the usage limit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ObjectLiteral
server.js:392:45
             [coupon.id, user_id],
             (err, result) => {
               if (result.usage_count >= coupon.max_uses_per_user) {
-                return res.status(400).json({
-                  error: `Bạn đã sử dụng mã này ${coupon.max_uses_per_user} lần (đã đạt giới hạn)`,
-                });
+                return res.status(400).json({});
               }
 
killedBy: POST /api/apply-coupon — EP returns 400 when user has reached the usage limit
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ObjectLiteral
server.js:426:27
             discount_amount = coupon.discount_value;
           }
           const final_amount = total_amount - discount_amount;
-          return res.json({
-            success: true,
-            coupon_id: coupon.id,
-            discount_amount,
-            final_amount,
-            message: `Áp dụng thành công! Giảm ${coupon.type === "percent" ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
-          });
+          return res.json({});
         }
       } else {
killedBy: POST /api/apply-coupon — EP returns 200 with correct discount when valid fixed coupon meets min-order
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[NoCoverage] BlockStatement
server.js:444:64
 });
 
 // POST save coupon usage (called after successful checkout)
-app.post("/api/coupon-usage", authenticateToken, (req, res) => {
-  const { coupon_id } = req.body;
-  db.run(
-    "INSERT INTO coupon_usage (coupon_id, user_id) VALUES (?, ?)",
-    [coupon_id, req.user.id],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Usage recorded" });
-    },
-  );
-});
+app.post("/api/coupon-usage", authenticateToken, (req, res) => {});
 
 // ADMIN: CRUD Coupons

[Survived] StringLiteral
server.js:444:10
 });
 
 // POST save coupon usage (called after successful checkout)
-app.post("/api/coupon-usage", authenticateToken, (req, res) => {
+app.post("", authenticateToken, (req, res) => {
   const { coupon_id } = req.body;
   db.run(

[NoCoverage] StringLiteral
server.js:451:27
     [coupon_id, req.user.id],
     function (err) {
       if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Usage recorded" });
+      res.json({ message: "" });
     },
   );

[NoCoverage] BlockStatement
server.js:457:65
 });
 
 // ADMIN: CRUD Coupons
-app.post("/api/admin/coupons", authenticateToken, (req, res) => {
-  const {
-    code,
-    type,
-    discount_value,
-    min_order_amount,
-    expired_at,
-    max_uses_per_user,
-  } = req.body;
-  db.run(
-    "INSERT INTO coupons (code, type, discount_value, min_order_amount, expired_at, max_uses_per_user) VALUES (?, ?, ?, ?, ?, ?)",
-    [
-      code,
-      type,
-      discount_value,
-      min_order_amount,
-      expired_at,
-      max_uses_per_user || 1,
-    ],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Coupon created", id: this.lastID });
-    },
-  );
-});
+app.post("/api/admin/coupons", authenticateToken, (req, res) => {});
 
 app.delete("/api/admin/coupons/:id", authenticateToken, (req, res) => {

[Survived] StringLiteral
server.js:457:10
 });
 
 // ADMIN: CRUD Coupons
-app.post("/api/admin/coupons", authenticateToken, (req, res) => {
+app.post("", authenticateToken, (req, res) => {
   const {
     code,

[NoCoverage] ConditionalExpression
server.js:474:7
       discount_value,
       min_order_amount,
       expired_at,
-      max_uses_per_user || 1,
+      false,
     ],
     function (err) {

[NoCoverage] LogicalOperator
server.js:474:7
       discount_value,
       min_order_amount,
       expired_at,
-      max_uses_per_user || 1,
+      max_uses_per_user && 1,
     ],
     function (err) {

[NoCoverage] BlockStatement
server.js:476:20
       expired_at,
       max_uses_per_user || 1,
     ],
-    function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Coupon created", id: this.lastID });
-    },
+    function (err) {},
   );
 });

[NoCoverage] StringLiteral
server.js:478:27
     ],
     function (err) {
       if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Coupon created", id: this.lastID });
+      res.json({ message: "", id: this.lastID });
     },
   );

[NoCoverage] ObjectLiteral
server.js:478:16
     ],
     function (err) {
       if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Coupon created", id: this.lastID });
+      res.json({});
     },
   );

[NoCoverage] BlockStatement
server.js:483:71
   );
 });
 
-app.delete("/api/admin/coupons/:id", authenticateToken, (req, res) => {
-  db.run("DELETE FROM coupons WHERE id = ?", [req.params.id], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
-    res.json({ message: "Coupon deleted" });
-  });
-});
+app.delete("/api/admin/coupons/:id", authenticateToken, (req, res) => {});
 
 // ==========================================

[NoCoverage] BlockStatement
server.js:484:78
 });
 
 app.delete("/api/admin/coupons/:id", authenticateToken, (req, res) => {
-  db.run("DELETE FROM coupons WHERE id = ?", [req.params.id], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
-    res.json({ message: "Coupon deleted" });
-  });
+  db.run("DELETE FROM coupons WHERE id = ?", [req.params.id], function (err) {});
 });
 

[NoCoverage] ConditionalExpression
server.js:485:9
 
 app.delete("/api/admin/coupons/:id", authenticateToken, (req, res) => {
   db.run("DELETE FROM coupons WHERE id = ?", [req.params.id], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
+    if (true) return res.status(500).json({ error: err.message });
     res.json({ message: "Coupon deleted" });
   });

[NoCoverage] ConditionalExpression
server.js:485:9
 
 app.delete("/api/admin/coupons/:id", authenticateToken, (req, res) => {
   db.run("DELETE FROM coupons WHERE id = ?", [req.params.id], function (err) {
-    if (err) return res.status(500).json({ error: err.message });
+    if (false) return res.status(500).json({ error: err.message });
     res.json({ message: "Coupon deleted" });
   });

[NoCoverage] BlockStatement
server.js:494:62
 // ADMIN APIS
 // ==========================================
 
-app.get("/api/admin/users", authenticateToken, (req, res) => {
-  db.all(
-    "SELECT id, name, email, role, login_attempts, locked_until, shipping_address FROM users",
-    [],
-    (err, users) => {
-      res.json(users);
-    },
-  );
-});
+app.get("/api/admin/users", authenticateToken, (req, res) => {});
 
 app.delete("/api/admin/users/:id", authenticateToken, (req, res) => {

[Survived] StringLiteral
server.js:494:9
 // ADMIN APIS
 // ==========================================
 
-app.get("/api/admin/users", authenticateToken, (req, res) => {
+app.get("", authenticateToken, (req, res) => {
   db.all(
     "SELECT id, name, email, role, login_attempts, locked_until, shipping_address FROM users",

[NoCoverage] ArrayDeclaration
server.js:497:5
 app.get("/api/admin/users", authenticateToken, (req, res) => {
   db.all(
     "SELECT id, name, email, role, login_attempts, locked_until, shipping_address FROM users",
-    [],
+    ["Stryker was here"],
     (err, users) => {
       res.json(users);

[NoCoverage] BlockStatement
server.js:498:21
   db.all(
     "SELECT id, name, email, role, login_attempts, locked_until, shipping_address FROM users",
     [],
-    (err, users) => {
-      res.json(users);
-    },
+    (err, users) => {},
   );
 });

[NoCoverage] BlockStatement
server.js:504:69
   );
 });
 
-app.delete("/api/admin/users/:id", authenticateToken, (req, res) => {
-  db.run("DELETE FROM users WHERE id = ?", [req.params.id], function (err) {
-    res.json({ message: "User deleted" });
-  });
-});
+app.delete("/api/admin/users/:id", authenticateToken, (req, res) => {});
 
 app.get("/api/admin/orders", authenticateToken, (req, res) => {

[NoCoverage] BlockStatement
server.js:505:76
 });
 
 app.delete("/api/admin/users/:id", authenticateToken, (req, res) => {
-  db.run("DELETE FROM users WHERE id = ?", [req.params.id], function (err) {
-    res.json({ message: "User deleted" });
-  });
+  db.run("DELETE FROM users WHERE id = ?", [req.params.id], function (err) {});
 });
 

[NoCoverage] ArrayDeclaration
server.js:505:44
 });
 
 app.delete("/api/admin/users/:id", authenticateToken, (req, res) => {
-  db.run("DELETE FROM users WHERE id = ?", [req.params.id], function (err) {
+  db.run("DELETE FROM users WHERE id = ?", [], function (err) {
     res.json({ message: "User deleted" });
   });

[NoCoverage] StringLiteral
server.js:506:25
 
 app.delete("/api/admin/users/:id", authenticateToken, (req, res) => {
   db.run("DELETE FROM users WHERE id = ?", [req.params.id], function (err) {
-    res.json({ message: "User deleted" });
+    res.json({ message: "" });
   });
 });

[NoCoverage] BlockStatement
server.js:510:63
   });
 });
 
-app.get("/api/admin/orders", authenticateToken, (req, res) => {
-  db.all(
-    `
-        SELECT orders.*, users.name as user_name 
-        FROM orders 
-        LEFT JOIN users ON orders.user_id = users.id
-        ORDER BY orders.id DESC
-    `,
-    [],
-    (err, orders) => {
-      res.json(orders);
-    },
-  );
-});
+app.get("/api/admin/orders", authenticateToken, (req, res) => {});
 
 app.put("/api/admin/orders/:id/status", authenticateToken, (req, res) => {

[Killed] StringLiteral
server.js:525:9
   );
 });
 
-app.put("/api/admin/orders/:id/status", authenticateToken, (req, res) => {
+app.put("", authenticateToken, (req, res) => {
   const { status } = req.body; // pending, confirmed, shipping, delivered, canceled
 
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is pending to confirmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
server.js:529:5
   const { status } = req.body; // pending, confirmed, shipping, delivered, canceled
 
   db.get(
-    "SELECT status FROM orders WHERE id = ?",
+    "",
     [req.params.id],
     (err, order) => {
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is pending to confirmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
server.js:538:9
       let isValidTransition = false;
 
       if (
-        currentStatus === "pending" &&
-        (status === "confirmed" || status === "canceled")
+        true
       )
         isValidTransition = true;
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 400 when transition is pending to delivered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] EqualityOperator
server.js:539:10
 
       if (
         currentStatus === "pending" &&
-        (status === "confirmed" || status === "canceled")
+        (status !== "confirmed" || status === "canceled")
       )
         isValidTransition = true;
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is pending to confirmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BooleanLiteral
server.js:541:29
         currentStatus === "pending" &&
         (status === "confirmed" || status === "canceled")
       )
-        isValidTransition = true;
+        isValidTransition = false;
       if (
         currentStatus === "confirmed" &&
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is pending to confirmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
server.js:543:9
       )
         isValidTransition = true;
       if (
-        currentStatus === "confirmed" &&
-        (status === "shipping" || status === "canceled")
+        false
       )
         isValidTransition = true;
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is confirmed to shipping
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] LogicalOperator
server.js:544:10
         isValidTransition = true;
       if (
         currentStatus === "confirmed" &&
-        (status === "shipping" || status === "canceled")
+        (status === "shipping" && status === "canceled")
       )
         isValidTransition = true;
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is confirmed to shipping
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
server.js:544:10
         isValidTransition = true;
       if (
         currentStatus === "confirmed" &&
-        (status === "shipping" || status === "canceled")
+        (false || status === "canceled")
       )
         isValidTransition = true;
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is confirmed to shipping
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] EqualityOperator
server.js:547:43
         (status === "shipping" || status === "canceled")
       )
         isValidTransition = true;
-      if (currentStatus === "shipping" && status === "delivered")
+      if (currentStatus === "shipping" && status !== "delivered")
         isValidTransition = true;
 
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is shipping to delivered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] LogicalOperator
server.js:547:11
         (status === "shipping" || status === "canceled")
       )
         isValidTransition = true;
-      if (currentStatus === "shipping" && status === "delivered")
+      if (currentStatus === "shipping" || status === "delivered")
         isValidTransition = true;
 
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 400 when transition is pending to delivered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BooleanLiteral
server.js:548:29
       )
         isValidTransition = true;
       if (currentStatus === "shipping" && status === "delivered")
-        isValidTransition = true;
+        isValidTransition = false;
 
       if (currentStatus === "canceled" && status === "delivered")
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is shipping to delivered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400
