[Killed] ConditionalExpression
server.js:550:11
       if (currentStatus === "shipping" && status === "delivered")
         isValidTransition = true;
 
-      if (currentStatus === "canceled" && status === "delivered")
+      if (true)
         isValidTransition = true;
 
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 400 when transition is pending to delivered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
server.js:550:11
       if (currentStatus === "shipping" && status === "delivered")
         isValidTransition = true;
 
-      if (currentStatus === "canceled" && status === "delivered")
+      if (true && status === "delivered")
         isValidTransition = true;
 
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 400 when transition is pending to delivered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[NoCoverage] BooleanLiteral
server.js:551:29
         isValidTransition = true;
 
       if (currentStatus === "canceled" && status === "delivered")
-        isValidTransition = true;
+        isValidTransition = false;
 
       if (!isValidTransition) {

[Killed] ConditionalExpression
server.js:553:11
       if (currentStatus === "canceled" && status === "delivered")
         isValidTransition = true;
 
-      if (!isValidTransition) {
+      if (true) {
         return res.status(400).json({
           error: `Invalid state transition from ${currentStatus} to ${status}`,
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is pending to confirmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] StringLiteral
server.js:555:18
 
       if (!isValidTransition) {
         return res.status(400).json({
-          error: `Invalid state transition from ${currentStatus} to ${status}`,
+          error: ``,
         });
       }
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 400 when transition is pending to delivered
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /invalid state transition/i
Received string:  ""

[Killed] StringLiteral
server.js:563:31
         "UPDATE orders SET status = ? WHERE id = ?",
         [status, req.params.id],
         function (err) {
-          res.json({ message: "Order status updated" });
+          res.json({ message: "" });
         },
       );
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is pending to confirmed
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /updated/i
Received string:  ""

[Killed] ObjectLiteral
server.js:563:20
         "UPDATE orders SET status = ? WHERE id = ?",
         [status, req.params.id],
         function (err) {
-          res.json({ message: "Order status updated" });
+          res.json({});
         },
       );
killedBy: PUT /api/admin/orders/:id/status - T3b baseline returns 200 and updates status when transition is pending to confirmed
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[NoCoverage] BlockStatement
server.js:570:30
   );
 });
 
-if (require.main === module) {
-  app.listen(PORT, () => {
-    console.log(`Server is running on http://localhost:${PORT}`);
-  });
-}
+if (require.main === module) {}
 
 module.exports = app;

[NoCoverage] BlockStatement
server.js:571:26
 });
 
 if (require.main === module) {
-  app.listen(PORT, () => {
-    console.log(`Server is running on http://localhost:${PORT}`);
-  });
+  app.listen(PORT, () => {});
 }
 
